// import 'package:flutter/material.dart';
// const mainColor = Color(0xFFEB2523);
// const secondaryColor = Color(0xFFB74093);
// const titleColor = Color(0xFFB74093);

import 'package:flutter/material.dart';

const mainBgColor = Color.fromARGB(255, 220, 219, 219);
const colorPrimary = Color.fromARGB(255, 190, 124, 27);
const colorAccent = Color.fromARGB(255, 230, 156, 41);
const listBgColor = Color.fromARGB(255, 240, 240, 240);

const Color customOrange = Color.fromRGBO(235, 37, 35, 1.0);

const String emailAddress = "mkcchoiraa@gmail.com";

String aboutTitle = "በመሠረተ ክርስቶስ ቤተ ክርስቲያን የአዲስ አበባ ክልል መዘምራን አጭር የአገልግሎት ታሪክ";
String aboutBottomText = "ዘምሩ ለአምላካችን ዘምሩ፤ ዘምሩ ለንጉሣችን ዘምሩ። መዝ 47፡6";

String aboutDetail = "የመሠረተ ክርስቶስ ቤተ ክርስቲያን፣ ከአሜሪካን በመጡ  በሜኖናይት ሚስዮኖች አገልግሎት በ1943ዓም ዐስር ሰዎች ጥምቀት በመፈጸም ተተከለች። የአዲስ አበባ አጥቢያ መሠረተ ክርስቶስ ቤተ ክርስቲያን በ1953ዓም በኦሎምፒያ አካባቢ የራሷን ጸሎት ቤት በመገንባት የአምልኮ ሥርዓቷን ስትፈጽም ቆይታለች። በጣት የሚቆጠሩት አሜሪካውያኑ እና ኢትዮጲያዊያኑ በመጽሐፍ ታትመው የተዘጋጁ የዝማሬ መጽሐፎችን ለአምልኮ ሲጠቀሙ ቆይተዋል። የሜኖናይት አገልግሎት የነበረው የመርሐ ዕውራን ትምህርት ቤት መዘምራን ያዘጋጁት የመዝሙር መጽሐፍ ‘ማሕሌተ እግዚአብሔር’ እና ‘ውዳሴ አምላክ’ በእጅጉ የጠቀመ ነበር። \n\n ከ 1965 ዓ ም በኋላ ቤተክርስቲያኒቱ ካሪዝማቲክ እንቅስቃሴ ውስጥ ከመግባቷ ጋር ተያይዞ ብዙ ወጣቶች ወደ ቤተክርስቲያኒቱ ይጎርፉ ጀመረ። ከዚህም ጋር ተያይዞ ቤተክርስቲያኒቱ በ1966 ዓ ም የራስዋን መዘምራን አቋቋመች። \n በሽማግሌ መሪዎች ምክክር፣ ወጣቶቹን በማሰባሰብ የመጀመሪያውን የመዘምራን ቡድን ያቋቋመው የቤተክርስቲያኒቱ ወንጌላዊ የነበረው ዳኜ አሰፋ ነበር። \n ወንጌላዊ ዳኜ አሰፋ በአጥቢያዋ ውስጥ የሚገኙትን 27 ወጣቶች በማሰባሰብ የሀ መዘምራንን አቋቋመ። በ1968 ዓ ም የ ለ መዘምራንን በ7 ወንድሞችና 5 እህቶች አገልግሎት እንዲሰጡ ተደረገ። \n\n ይህ ወቅት በአገሪቱ የነበረው የሶሺያሊስት ርዕየተ ዓለም አራማጅ መንግሥት ስለነበረ በርካታ ችግሮች የፈጠረበት ወቅት ነበረ። በአንጻሩ፣ ብዙዎች ጌታ ኢየሱስን በመቀበል ወደ ቤተ ክርስቲያን የጎረፉበት የእግዚአብሔር ክንድ በታላቅ አደራረግ የሠራበት፣ የመንፈስ ቅዱስ እሳት የወረደበት፣ ድንቅና ተአምራት የተደረገበትና የዝማሬ አገልግሎት እጅግ ያደገበት ወቅት ነበር። \n በእነዚህ የጅማሬ አገልግሎት ጊዜያት የዕድገት በህብረት ዘመቻ እና የፖለቲካው ጡዘት በመዘምራኑ ላይ በርካታ ተግዳሮት ያሳለፈ ቢሆንም እግዚአብሔር ዕለት ዕለት በአገልግሎቱ እያሳደገ የመዘምራን አባላት ለአገልግሎት እየቀባ የዝማሬን ጸጋ በመሐከላቸው ያፈሰሰበት ወቅት ነበር። በዝማሬው የአገልግሎት ወቅት እግዚአብሔር ሰዎችን ከአጋንንት እስራት ሲፈታ፣ ለታወሩ ማየትን ለአንካሳውና ለተለያዩ በሽተኞች ፈውስን እየሰጠ በአዲስ አበባ ብቻ ሳይሆን  በበርካታ የአገሪቱ ክፍሎች በመሄድ የመዘምራን ቡድኑ ሲያገለግል ለብዙዎች መጽናናት፣ መዳንና ፈውስ ምክንያት ሆኗል። \n\n የደርግ መንግሥት የሚያራምደው የፖለቲካ አስተሳሰብ ሃይማኖትን የሚጻረር በመሆኑ በተለይ የወንጌላውያን አብያተ ክርስቲያናት እንዲዘጉ መሪዎችም እንዲታሰሩ በተወሰኑ በአገሪቱ ያሉ የመሠረተ ክርስቶስ ቤተ ክርስቲያን ተቋማት በሙሉ እንዲዘጉ ሲደረግ የአዲስ አበባ አጥቢያዋም በጥር 16 ቀን 1974ዓም የመዘምራኑን መሣሪያዎችና የአገልግሎት ልብስ ጨምሮ የቤተ ክርስቲያኗን ንብረት በመውረስ እንዲዘጋ አደረገ። \n ቤተ ክርስቲያኗም ከተዘጋች በኋላ መዘምራኑ በህቡዕ ለመሰባሰብ፣ አብሮ ለመጸለይና ለማምለክ ችግር ቢሆንም በተወሰኑ ዓመታት ሕብረት ማድረግ ሳይቻል ቀረ። ቀስ በቀስም የተወሰኑ አባላት በየቤቱ ከሚደረገው ሕብረት በተጨማሪ ለብቻቸው በመገናኘት አልፎ አልፎ በቤት ውስጥ በሚካሄደው የቤት ሕብረት አምልኮ ላይ በማገልገል ቆይተዋል። \n ከ1981 ዓ ም ወዲህ ሁለቱ የመዘምራን ቡድኖች ተደባልቀው አገልግሎቱን እንዲቀጥሉ ተደረገ። \n\n ከ1983ዓም ጀምሮ በተገኘው የእምነት ነጻነት በመሠረተ ክርስቶስና በሌሎችም ወንጌላውያን አቢያተ ክርስቲያናት በተከፈቱ አጥቢያዎች በአዲስ አበባና በክፍለ አገር ከኢትዮጵያም ውጭ በመሄድ አገልግሎቱ በጌታ ጸጋ ሙላት በስፋት ቀጠለ። ዛሬም በአዲስ አበባ ለሚገኙ ከ40 ለሚበልጡ የመሠረተ ክርስቶስ አጥቢያዎችና ከተለያዩ አቢያተ ክርስቲያናት ለሚቀርቡ የአገልግሎት ጥሪዎች በእግዚአብሔር ጸጋ፣ በትጋትና በታማኝነት በ31 አባላት እያገለገለ ይገኛል። \n እግዚአብሔር በሰጠን አገልግሎት በተሰማራንበት የሥራ መስክ ሁሉ አንድም ቀን ክብሩ ሳይቀንስም አብሮነቱ ሳይጓደል እስከ ዛሬ እንድናገለግል ሲያደርገን እኛም በፊቱ በንጽሕና ፣ በታማኝነት፣ በትጋትና በመሰጠት የተቀበልነውን መክሊት ልንፈጽም ራሳችንን ሰጠነው። እርሱም እስከ ዛሬ በጸጋውና በችሮታው አቆመን። ስሙ የተባረከ ይሁን። \n በዚህም መሠረት እስከ ዛሬ ዝማሬዎቻችንን በካሴትና በሲዲ 8 አልበም እንዲሁም በቪሲዲና በዲቪዲ 4 አልበም በማሳተም ለቅዱሳን መታነጽ እንዲሆን አቅርበናል። በተጨማሪም ዝማሬዎቻቸንን በስፋት ማግኘት ለሚፈልጉ በመዘምራኑ በዌብ ሳይትና በዲጂታል ኤሌክትሮኒክስ ለማድረስ በዚህ መልክ አዘጋጅተናል። እግዚአብሔር ሁላችሁንም አብዝቶ ይባርክ።";
String iosAppLink = "https://play.google.com/store/apps/details?id=com.ma.butyam.mkcchoir";
String androidAppLink = "https://play.google.com/store/apps/details?id=com.ma.butyam.mkcchoir";